Revit 2027 API
LinePattern.GetSegments Method
 Gets the sequence of segments that defines this line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<LinePatternSegment> GetSegments()
Public Function GetSegments As IList(Of LinePatternSegment)
public:
IList<LinePatternSegment^>^ GetSegments()
member GetSegments : unit -> IList<LinePatternSegment>
Return Value
IList<LinePatternSegment>
 The sequence of segments.
See Also
Reference
LinePattern Class
Autodesk.Revit.DB Namespace